(function (global, factory) {
  typeof exports === "object" && typeof module !== "undefined"
    ? (module.exports = factory())
    : typeof define === "function" && define.amd
    ? define(factory)
    : ((global.FormValidation = global.FormValidation || {}),
      (global.FormValidation.locales = global.FormValidation.locales || {}),
      (global.FormValidation.locales.ru_RU = factory()));
})(this, function () {
  "use strict";

  /**
   * Russian language package
   * Translated by @cylon-v. Improved by @stepin, @oleg-voloshyn
   */

  var ru_RU = {
    base64: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РєРѕСЂСЂРµРєС‚РЅСѓСЋ СЃС‚СЂРѕРєСѓ base64",
    },
    between: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ Р·РЅР°С‡РµРЅРёРµ РѕС‚ %s РґРѕ %s",
      notInclusive:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ Р·РЅР°С‡РµРЅРёРµ РјРµР¶РґСѓ %s Рё %s",
    },
    bic: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РЅРѕРјРµСЂ BIC",
    },
    callback: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РєРѕСЂСЂРµРєС‚РЅРѕРµ Р·РЅР°С‡РµРЅРёРµ",
    },
    choice: {
      between: "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІС‹Р±РµСЂРёС‚Рµ %s-%s РѕРїС†РёР№",
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РєРѕСЂСЂРµРєС‚РЅРѕРµ Р·РЅР°С‡РµРЅРёРµ",
      less: "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІС‹Р±РµСЂРёС‚Рµ С…РѕС‚СЏ Р±С‹ %s РѕРїС†РёР№",
      more: "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІС‹Р±РµСЂРёС‚Рµ РЅРµ Р±РѕР»СЊС€Рµ %s РѕРїС†РёР№",
    },
    color: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РЅРѕРјРµСЂ С†РІРµС‚Р°",
    },
    creditCard: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РЅРѕРјРµСЂ РєСЂРµРґРёС‚РЅРѕР№ РєР°СЂС‚С‹",
    },
    cusip: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РЅРѕРјРµСЂ CUSIP",
    },
    date: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅСѓСЋ РґР°С‚Сѓ",
      max: "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РґР°С‚Сѓ РїРµСЂРµРґ %s",
      min: "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РґР°С‚Сѓ РїРѕСЃР»Рµ %s",
      range:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РґР°С‚Сѓ РІ РґРёР°РїР°Р·РѕРЅРµ %s - %s",
    },
    different: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РґСЂСѓРіРѕРµ Р·РЅР°С‡РµРЅРёРµ",
    },
    digits: {
      default: "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ С‚РѕР»СЊРєРѕ С†РёС„СЂС‹",
    },
    ean: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РЅРѕРјРµСЂ EAN",
    },
    ein: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РЅРѕРјРµСЂ EIN",
    },
    emailAddress: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ Р°РґСЂРµСЃ СЌР». РїРѕС‡С‚С‹",
    },
    file: {
      default: "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІС‹Р±РµСЂРёС‚Рµ С„Р°Р№Р»",
    },
    greaterThan: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ Р·РЅР°С‡РµРЅРёРµ Р±РѕР»СЊС€РµРµ РёР»Рё СЂР°РІРЅРѕРµ %s",
      notInclusive:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ Р·РЅР°С‡РµРЅРёРµ Р±РѕР»СЊС€Рµ %s",
    },
    grid: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РЅРѕРјРµСЂ GRId",
    },
    hex: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅРѕРµ С€РµСЃС‚РЅР°РґС†Р°С‚РёСЂРёС‡РЅРѕРµ С‡РёСЃР»Рѕ",
    },
    iban: {
      countries: {
        AD: "РђРЅРґРѕСЂСЂРµ",
        AE: "РћР±СЉРµРґРёРЅС‘РЅРЅС‹С… РђСЂР°Р±СЃРєРёС… Р­РјРёСЂР°С‚Р°С…",
        AL: "РђР»Р±Р°РЅРёРё",
        AO: "РђРЅРіРѕР»Рµ",
        AT: "РђРІСЃС‚СЂРёРё",
        AZ: "РђР·РµСЂР±Р°Р№РґР¶Р°РЅРµ",
        BA: "Р‘РѕСЃРЅРёРё Рё Р“РµСЂС†РµРіРѕРІРёРЅРµ",
        BE: "Р‘РµР»СЊРіРёРё",
        BF: "Р‘СѓСЂРєРёРЅР°-Р¤Р°СЃРѕ",
        BG: "Р‘РѕР»РіР°СЂРёРё",
        BH: "Р‘Р°С…СЂРµР№РЅРµ",
        BI: "Р‘СѓСЂСѓРЅРґРё",
        BJ: "Р‘РµРЅРёРЅРµ",
        BR: "Р‘СЂР°Р·РёР»РёРё",
        CH: "РЁРІРµР№С†Р°СЂРёРё",
        CI: "РљРѕС‚-Рґ'РРІСѓР°СЂРµ",
        CM: "РљР°РјРµСЂСѓРЅРµ",
        CR: "РљРѕСЃС‚Р°-Р РёРєРµ",
        CV: "РљР°Р±Рѕ-Р’РµСЂРґРµ",
        CY: "РљРёРїСЂРµ",
        CZ: "Р§РµС€СЃРєР°СЏ СЂРµСЃРїСѓР±Р»РёРєР°",
        DE: "Р“РµСЂРјР°РЅРёРё",
        DK: "Р”Р°РЅРёРё",
        DO: "Р”РѕРјРёРЅРёРєР°РЅРµ Р РµСЃРїСѓР±Р»РёРєР°",
        DZ: "РђР»Р¶РёСЂРµ",
        EE: "Р­СЃС‚РѕРЅРёРё",
        ES: "РСЃРїР°РЅРёРё",
        FI: "Р¤РёРЅР»СЏРЅРґРёРё",
        FO: "Р¤Р°СЂРµСЂСЃРєРёС… РѕСЃС‚СЂРѕРІР°С…",
        FR: "Р¤СЂР°РЅС†РёРё",
        GB: "Р’РµР»РёРєРѕР±СЂРёС‚Р°РЅРёРё",
        GE: "Р“СЂСѓР·РёРё",
        GI: "Р“РёР±СЂР°Р»С‚Р°СЂРµ",
        GL: "Р“СЂРµРЅР»Р°РЅРґРёРё",
        GR: "Р“СЂРµС†РёРё",
        GT: "Р“РІР°С‚РµРјР°Р»Рµ",
        HR: "РҐРѕСЂРІР°С‚РёРё",
        HU: "Р’РµРЅРіСЂРёРё",
        IE: "РСЂР»Р°РЅРґРёРё",
        IL: "РР·СЂР°РёР»Рµ",
        IR: "РСЂР°РЅРµ",
        IS: "РСЃР»Р°РЅРґРёРё",
        IT: "РС‚Р°Р»РёРё",
        JO: "РРѕСЂРґР°РЅРёРё",
        KW: "РљСѓРІРµР№С‚Рµ",
        KZ: "РљР°Р·Р°С…СЃС‚Р°РЅРµ",
        LB: "Р›РёРІР°РЅРµ",
        LI: "Р›РёС…С‚РµРЅС€С‚РµР№РЅРµ",
        LT: "Р›РёС‚РІРµ",
        LU: "Р›СЋРєСЃРµРјР±СѓСЂРіРµ",
        LV: "Р›Р°С‚РІРёРё",
        MC: "РњРѕРЅР°РєРѕ",
        MD: "РњРѕР»РґРѕРІРµ",
        ME: "Р§РµСЂРЅРѕРіРѕСЂРёРё",
        MG: "РњР°РґР°РіР°СЃРєР°СЂРµ",
        MK: "РњР°РєРµРґРѕРЅРёРё",
        ML: "РњР°Р»Рё",
        MR: "РњР°РІСЂРёС‚Р°РЅРёРё",
        MT: "РњР°Р»СЊС‚Рµ",
        MU: "РњР°РІСЂРёРєРёРё",
        MZ: "РњРѕР·Р°РјР±РёРєРµ",
        NL: "РќРёРґРµСЂР»Р°РЅРґР°С…",
        NO: "РќРѕСЂРІРµРіРёРё",
        PK: "РџР°РєРёСЃС‚Р°РЅРµ",
        PL: "РџРѕР»СЊС€Рµ",
        PS: "РџР°Р»РµСЃС‚РёРЅРµ",
        PT: "РџРѕСЂС‚СѓРіР°Р»РёРё",
        QA: "РљР°С‚Р°СЂРµ",
        RO: "Р СѓРјС‹РЅРёРё",
        RS: "РЎРµСЂР±РёРё",
        SA: "РЎР°СѓРґРѕРІСЃРєРѕР№ РђСЂР°РІРёРё",
        SE: "РЁРІРµС†РёРё",
        SI: "РЎР»РѕРІРµРЅРёРё",
        SK: "РЎР»РѕРІР°РєРёРё",
        SM: "РЎР°РЅ-РњР°СЂРёРЅРѕ",
        SN: "РЎРµРЅРµРіР°Р»Рµ",
        TL: "Р’РѕСЃС‚РѕС‡РЅС‹Р№ РўРёРјРѕСЂ",
        TN: "РўСѓРЅРёСЃРµ",
        TR: "РўСѓСЂС†РёРё",
        VG: "Р‘СЂРёС‚Р°РЅСЃРєРёС… Р’РёСЂРіРёРЅСЃРєРёС… РѕСЃС‚СЂРѕРІР°С…",
        XK: "Р РµСЃРїСѓР±Р»РёРєР° РљРѕСЃРѕРІРѕ",
      },
      country:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РЅРѕРјРµСЂ IBAN РІ %s",
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РЅРѕРјРµСЂ IBAN",
    },
    id: {
      countries: {
        BA: "Р‘РѕСЃРЅРёРё Рё Р“РµСЂС†РµРіРѕРІРёРЅРµ",
        BG: "Р‘РѕР»РіР°СЂРёРё",
        BR: "Р‘СЂР°Р·РёР»РёРё",
        CH: "РЁРІРµР№С†Р°СЂРёРё",
        CL: "Р§РёР»Рё",
        CN: "РљРёС‚Р°Рµ",
        CZ: "Р§РµС€СЃРєР°СЏ СЂРµСЃРїСѓР±Р»РёРєР°",
        DK: "Р”Р°РЅРёРё",
        EE: "Р­СЃС‚РѕРЅРёРё",
        ES: "РСЃРїР°РЅРёРё",
        FI: "Р¤РёРЅР»СЏРЅРґРёРё",
        HR: "РҐРѕСЂРІР°С‚РёРё",
        IE: "РСЂР»Р°РЅРґРёРё",
        IS: "РСЃР»Р°РЅРґРёРё",
        LT: "Р›РёС‚РІРµ",
        LV: "Р›Р°С‚РІРёРё",
        ME: "Р§РµСЂРЅРѕРіРѕСЂРёРё",
        MK: "РњР°РєРµРґРѕРЅРёРё",
        NL: "РќРёРґРµСЂР»Р°РЅРґР°С…",
        PL: "РџРѕР»СЊС€Рµ",
        RO: "Р СѓРјС‹РЅРёРё",
        RS: "РЎРµСЂР±РёРё",
        SE: "РЁРІРµС†РёРё",
        SI: "РЎР»РѕРІРµРЅРёРё",
        SK: "РЎР»РѕРІР°РєРёРё",
        SM: "РЎР°РЅ-РњР°СЂРёРЅРѕ",
        TH: "РўР°Р№Р»Р°РЅРґРµ",
        TR: "РўСѓСЂС†РёРё",
        ZA: "Р®РђР ",
      },
      country:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РёРґРµРЅС‚РёС„РёРєР°С†РёРѕРЅРЅС‹Р№ РЅРѕРјРµСЂ РІ %s",
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РёРґРµРЅС‚РёС„РёРєР°С†РёРѕРЅРЅС‹Р№ РЅРѕРјРµСЂ",
    },
    identical: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ С‚Р°РєРѕРµ Р¶Рµ Р·РЅР°С‡РµРЅРёРµ",
    },
    imei: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РЅРѕРјРµСЂ IMEI",
    },
    imo: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РЅРѕРјРµСЂ IMO",
    },
    integer: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅРѕРµ С†РµР»РѕРµ С‡РёСЃР»Рѕ",
    },
    ip: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ IP-Р°РґСЂРµСЃ",
      ipv4: "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ IPv4-Р°РґСЂРµСЃ",
      ipv6: "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ IPv6-Р°РґСЂРµСЃ",
    },
    isbn: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РЅРѕРјРµСЂ ISBN",
    },
    isin: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РЅРѕРјРµСЂ ISIN",
    },
    ismn: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РЅРѕРјРµСЂ ISMN",
    },
    issn: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РЅРѕРјРµСЂ ISSN",
    },
    lessThan: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ Р·РЅР°С‡РµРЅРёРµ РјРµРЅСЊС€РµРµ РёР»Рё СЂР°РІРЅРѕРµ %s",
      notInclusive:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ Р·РЅР°С‡РµРЅРёРµ РјРµРЅСЊС€Рµ %s",
    },
    mac: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ MAC-Р°РґСЂРµСЃ",
    },
    meid: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РЅРѕРјРµСЂ MEID",
    },
    notEmpty: {
      default: "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ Р·РЅР°С‡РµРЅРёРµ",
    },
    numeric: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РєРѕСЂСЂРµРєС‚РЅРѕРµ РґРµР№СЃС‚РІРёС‚РµР»СЊРЅРѕРµ С‡РёСЃР»Рѕ",
    },
    phone: {
      countries: {
        AE: "РћР±СЉРµРґРёРЅС‘РЅРЅС‹С… РђСЂР°Р±СЃРєРёС… Р­РјРёСЂР°С‚Р°С…",
        BG: "Р‘РѕР»РіР°СЂРёРё",
        BR: "Р‘СЂР°Р·РёР»РёРё",
        CN: "РљРёС‚Р°Рµ",
        CZ: "Р§РµС€СЃРєР°СЏ СЂРµСЃРїСѓР±Р»РёРєР°",
        DE: "Р“РµСЂРјР°РЅРёРё",
        DK: "Р”Р°РЅРёРё",
        ES: "РСЃРїР°РЅРёРё",
        FR: "Р¤СЂР°РЅС†РёРё",
        GB: "Р’РµР»РёРєРѕР±СЂРёС‚Р°РЅРёРё",
        IN: "РРЅРґРёСЏ",
        MA: "РњР°СЂРѕРєРєРѕ",
        NL: "РќРёРґРµСЂР»Р°РЅРґР°С…",
        PK: "РџР°РєРёСЃС‚Р°РЅРµ",
        RO: "Р СѓРјС‹РЅРёРё",
        RU: "Р РѕСЃСЃРёРё",
        SK: "РЎР»РѕРІР°РєРёРё",
        TH: "РўР°Р№Р»Р°РЅРґРµ",
        US: "РЎРЁРђ",
        VE: "Р’РµРЅРµСЃСѓСЌР»Рµ",
      },
      country:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РЅРѕРјРµСЂ С‚РµР»РµС„РѕРЅР° РІ %s",
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РЅРѕРјРµСЂ С‚РµР»РµС„РѕРЅР°",
    },
    promise: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РєРѕСЂСЂРµРєС‚РЅРѕРµ Р·РЅР°С‡РµРЅРёРµ",
    },
    regexp: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ Р·РЅР°С‡РµРЅРёРµ СЃРѕРѕС‚РІРµС‚СЃС‚РІСѓСЋС‰РµРµ С€Р°Р±Р»РѕРЅСѓ",
    },
    remote: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅРѕРµ Р·РЅР°С‡РµРЅРёРµ",
    },
    rtn: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РЅРѕРјРµСЂ RTN",
    },
    sedol: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РЅРѕРјРµСЂ SEDOL",
    },
    siren: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РЅРѕРјРµСЂ SIREN",
    },
    siret: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РЅРѕРјРµСЂ SIRET",
    },
    step: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ С€Р°Рі %s",
    },
    stringCase: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРѕРґРёС‚Рµ С‚РѕР»СЊРєРѕ СЃС‚СЂРѕС‡РЅС‹Рµ Р±СѓРєРІС‹",
      upper:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРѕРґРёС‚Рµ С‚РѕР»СЊРєРѕ Р·Р°РіР»Р°РІРЅС‹Рµ Р±СѓРєРІС‹",
    },
    stringLength: {
      between:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ СЃС‚СЂРѕРєСѓ РґР»РёРЅРѕР№ РѕС‚ %s РґРѕ %s СЃРёРјРІРѕР»РѕРІ",
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ Р·РЅР°С‡РµРЅРёРµ РєРѕСЂСЂРµРєС‚РЅРѕР№ РґР»РёРЅС‹",
      less: "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РЅРµ Р±РѕР»СЊС€Рµ %s СЃРёРјРІРѕР»РѕРІ",
      more: "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РЅРµ РјРµРЅСЊС€Рµ %s СЃРёРјРІРѕР»РѕРІ",
    },
    uri: {
      default: "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ URI",
    },
    uuid: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РЅРѕРјРµСЂ UUID",
      version:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РЅРѕРјРµСЂ UUID РІРµСЂСЃРёРё %s",
    },
    vat: {
      countries: {
        AT: "РђРІСЃС‚СЂРёРё",
        BE: "Р‘РµР»СЊРіРёРё",
        BG: "Р‘РѕР»РіР°СЂРёРё",
        BR: "Р‘СЂР°Р·РёР»РёРё",
        CH: "РЁРІРµР№С†Р°СЂРёРё",
        CY: "РљРёРїСЂРµ",
        CZ: "Р§РµС€СЃРєР°СЏ СЂРµСЃРїСѓР±Р»РёРєР°",
        DE: "Р“РµСЂРјР°РЅРёРё",
        DK: "Р”Р°РЅРёРё",
        EE: "Р­СЃС‚РѕРЅРёРё",
        EL: "Р“СЂРµС†РёРё",
        ES: "РСЃРїР°РЅРёРё",
        FI: "Р¤РёРЅР»СЏРЅРґРёРё",
        FR: "Р¤СЂР°РЅС†РёРё",
        GB: "Р’РµР»РёРєРѕР±СЂРёС‚Р°РЅРёРё",
        GR: "Р“СЂРµС†РёРё",
        HR: "РҐРѕСЂРІР°С‚РёРё",
        HU: "Р’РµРЅРіСЂРёРё",
        IE: "РСЂР»Р°РЅРґРёРё",
        IS: "РСЃР»Р°РЅРґРёРё",
        IT: "РС‚Р°Р»РёРё",
        LT: "Р›РёС‚РІРµ",
        LU: "Р›СЋРєСЃРµРјР±СѓСЂРіРµ",
        LV: "Р›Р°С‚РІРёРё",
        MT: "РњР°Р»СЊС‚Рµ",
        NL: "РќРёРґРµСЂР»Р°РЅРґР°С…",
        NO: "РќРѕСЂРІРµРіРёРё",
        PL: "РџРѕР»СЊС€Рµ",
        PT: "РџРѕСЂС‚СѓРіР°Р»РёРё",
        RO: "Р СѓРјС‹РЅРёРё",
        RS: "РЎРµСЂР±РёРё",
        RU: "Р РѕСЃСЃРёРё",
        SE: "РЁРІРµС†РёРё",
        SI: "РЎР»РѕРІРµРЅРёРё",
        SK: "РЎР»РѕРІР°РєРёРё",
        VE: "Р’РµРЅРµСЃСѓСЌР»Рµ",
        ZA: "Р®РђР ",
      },
      country:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РЅРѕРјРµСЂ РРќРќ (VAT) РІ %s",
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РЅРѕРјРµСЂ РРќРќ",
    },
    vin: {
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РЅРѕРјРµСЂ VIN",
    },
    zipCode: {
      countries: {
        AT: "РђРІСЃС‚СЂРёРё",
        BG: "Р‘РѕР»РіР°СЂРёРё",
        BR: "Р‘СЂР°Р·РёР»РёРё",
        CA: "РљР°РЅР°РґРµ",
        CH: "РЁРІРµР№С†Р°СЂРёРё",
        CZ: "Р§РµС€СЃРєР°СЏ СЂРµСЃРїСѓР±Р»РёРєР°",
        DE: "Р“РµСЂРјР°РЅРёРё",
        DK: "Р”Р°РЅРёРё",
        ES: "РСЃРїР°РЅРёРё",
        FR: "Р¤СЂР°РЅС†РёРё",
        GB: "Р’РµР»РёРєРѕР±СЂРёС‚Р°РЅРёРё",
        IE: "РСЂР»Р°РЅРґРёРё",
        IN: "РРЅРґРёСЏ",
        IT: "РС‚Р°Р»РёРё",
        MA: "РњР°СЂРѕРєРєРѕ",
        NL: "РќРёРґРµСЂР»Р°РЅРґР°С…",
        PL: "РџРѕР»СЊС€Рµ",
        PT: "РџРѕСЂС‚СѓРіР°Р»РёРё",
        RO: "Р СѓРјС‹РЅРёРё",
        RU: "Р РѕСЃСЃРёРё",
        SE: "РЁРІРµС†РёРё",
        SG: "РЎРёРЅРіР°РїСѓСЂРµ",
        SK: "РЎР»РѕРІР°РєРёРё",
        US: "РЎРЁРђ",
      },
      country:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РїРѕС‡С‚РѕРІС‹Р№ РёРЅРґРµРєСЃ РІ %s",
      default:
        "РџРѕР¶Р°Р»СѓР№СЃС‚Р°, РІРІРµРґРёС‚Рµ РїСЂР°РІРёР»СЊРЅС‹Р№ РїРѕС‡С‚РѕРІС‹Р№ РёРЅРґРµРєСЃ",
    },
  };

  return ru_RU;
});
